"use client";

import { Box, Heading, Text } from "@chakra-ui/react";

export default function Term() {
  return (
    <Box w="100%" p={2}>
      <Heading size="lg">Watt利用規約</Heading>
      <Heading size="md" mt={4} mb={2}>
        第1条 本規約の適用
      </Heading>
      <Text>
        Watt株式会社（以下「当社」といいます。）は、当社が提供するサービス「Watt」（以下「本サイト」といいます。）及び提携する企業と共同で運営する各種ウェブサイト（各種ウェブサイト関連アプリケーションも含みます）において、事業者（以下「サービス提供者」といいます。）が提供するサービスなどの価格を当社が管理・運営するインターネットウェブサイト、当社が指定するインターネットウェブサイト上に掲載し、サービス情報の閲覧、サービスの利用の申込みをするサービスと、これに付随するメール配信その他の各種情報提供サービス（以下、「本サービス」といいます。）のWatt利用者（以下「メンバー」といいます。）の利用について、以下のとおり利用規約を定めます。
        <br />
        当社は、メンバーの皆様の承諾を得ることなく本規約を変更することができ、変更後の本規約は、当社が別途定める場合を除いて、本サービス上で表示された時点より効力を生じるものとします。
      </Text>
      <Heading size="md" mt={4} mb={2}>
        第2条 サービスの契約
      </Heading>
      <Text>
        メンバーに提供されるサービスの内容は、サービス提供者が任意にサービス内容、金額を決定し、又は随時変更ができるものとします。サービスの契約は、メンバーが希望するサービスへの申込みをし、メンバーが希望するサービス内容などと、金額が表示された画面をサービス提供者に提示し、サービス提供者がサービスの提供が可能と認めたタイミングで契約が成立します。なおサービスの契約は、サービス提供者がサービスの提供が困難になる場合を除き、キャンセルすることは出来ません。
      </Text>
      <Heading size="md" mt={4} mb={2}>
        第3条 サービス内容
      </Heading>
      <Text>
        本サイトに掲載されている当該サービスの提供に関し、当社は何らの関与もしません。メンバーは、本サービスを通じてサービス提供者のサービスを利用する場合、自己の責任においてサービス提供者を利用するものとし、内容等のサービス提供者のサービスに関する問い合わせ・要望等は、当該サービス提供者に対して直接行うものとします。
        <br />
        メンバーは､本サービスを通じてサービス提供者を訪れるにあたり、次の行為をしてはならないものとします。
        <br />
        <br />
        【1】本サービスを通じた来店の無断キャンセル
        <br />
        【2】サービスの利用において支払うべき対価の未払い
        <br />
        【3】サービスの不正利用や不正な支払い
        <br />
        【4】公序良俗に反する内容の情報、文書及び図形等を他人に公開する行為
        <br />
        【5】同一人物が複数のWattメンバー登録を行うこと
        <br />
        【6】ID及びパスワードの不正使用又は他のメンバー又は第三者に使用させること
        <br />
        【7】当社、サービス提供者又は第三者に対する迷惑行為
        <br />
        【8】その他法令に違反する、又は違反する恐れのある行為
        <br />
        【9】他人になりすまして情報を送信又は書き込む行為
        <br />
        <br />
        当社は、メンバーの皆様が前項に違反した場合、その他当社が本サービスの運営上不適当と判断する行為を行った場合には、当該メンバーに対して、本サービスの利用停止、メンバー資格の剥奪、損害賠償請求等必要な措置（法的措置を含みます。）を取ることができるものとします。違反するメンバーの行為によって、当社又は第三者が損害を被った場合、当該メンバーは、自己の責任と費用をもって、損害を賠償しなければなりません。
      </Text>
      <Heading size="md" mt={4} mb={2}>
        第４条 投稿ルール等
      </Heading>
      <Text>
        当社は､本サービスにおける情報の充実化・利用の促進を目的として､本サービス上にて､投稿サービスを運営します。
        <br />
        当社は､投稿サービスにおいて投稿されたメンバーからのコメント､お気に入り情報、写真､SNS,情報等（以下総称して「コメント」といいます。）について､メンバーの許諾なく自由に､以下の処理を無償でする事ができるものとします。
        <br />
        メンバーは、投稿サービスへの投稿後、投稿者であるメンバーのいかなる理由があっても、当社が当該コメントを削除する義務を負わないことにつき予め了承するものとします。
        <br />
        <br />
        【１】本サービスに掲載すること、又は掲載しないこと。
        <br />
        【２】本サービスに掲載したコメントを、掲載後に修正、削除すること。
        <br />
        【３】本サービス以外の当社の指定するメディアにおいて、前各号の処理をすること。
        <br />
        【４】個人を特定できない形でサービス提供者に提供すること。
        <br />
        【５】レコメンド機能の追加等本サービスの改善のために分析・利用すること。
        <br />
        <br />
        コメントの著作権（著作権法第27条､第28条の権利を含みます。）はメンバーに帰属します。但し、当社は当該コメントを自由に使用することができるものとし、メンバーは､当社によるコメントの改変や公表の有無等について､著作者人格権を行使せず､異議を申し立てないことを承諾するものとします。
        <br />
        メンバーが、投稿サービスに投稿するコメントは、原則として自己が著作権その他の一切の権利を有するコメントに限るものとします。メンバーが、自己以外の第三者の権利が含まれるコメント（例、第三者が被写体となった写真、第三者の作成した著作物又は公共の建造物等が写った写真、第三者の発信したコメント等）（以下「第三者コメント等」といいます。）の投稿・掲載を希望される場合には、本規約の内容及び当該投稿・掲載について、第三者コメント等の著作権者を含む一切の権利者（被写体としてプライバシー権を有する方、肖像権を有する方、コメントの著作権を有する方を含みますがこれに限りません。）の方の承諾を必ず得るものとし、当該承諾を得た第三者コメント等のみを投稿するものとします。
        <br />
        メンバーは、コメントの内容に責任を負い、関係のない内容を投稿しないものとします。
        <br />
        当社は、メンバーが本規約に違反したと判断した場合、メンバーに対し事前に通知することなく、当該メンバーによる本サービスの利用の全部又は一部を一時中止、当該メンバー情報の全部又は一部の削除もしくはメンバーの除名等、当社が適当と認める措置を行うことができるものとします。なお、その場合、当該措置に伴う一切の不利益に対して当社は責任を負いません。
        <br />
      </Text>
      <Heading size="md" mt={4} mb={2}>
        第５条 本サービスの機能変更、停止、廃止
      </Heading>
      <Text>
        当社は、メンバーの皆様への事前の通知や承諾なしに、本サービスの機能変更、一時的な運用の停止、廃止を行うことがあります。
      </Text>
      <Heading size="md" mt={4} mb={2}>
        第６条 免責事項
      </Heading>
      <Text>
        Wattは、メンバーご自身の責任においてご利用いただきます。また、以下の各号につき予めご了承いただくものとします。
        <br />
        <br />
        【1】掲載されたコメントの内容に関していかなる保証もいたしません。
        <br />
        【2】Wattからリンクされた第三者が運営するサイトに関して、いかなる保証もいたしません。
        <br />
        【3】当該コメントをWatt上から削除する場合があります。なお、削除対象に該当するか否かは、全て当社が判断いたします。また、連携された外部サービス上に掲載された口コミに関しては、第三者が運営するサービス・ウェブサイトでの表示であるため、当社が削除等の措置を講じることはいたしません。
        <br />
        【4】当社は、サービス提供者の所在地にかかる地図情報に関してはいかなる保証もいたしません。なお、地図情報はGoogle
        Inc.より提供され、Google Inc.にて定めるTerms of Use及びプライバシーポリシーが適用となります。
        <br />
        【5】前各号及び本規約の他の規定の定めに関わらず、Wattに関するメンバーと当社との間の契約が消費者契約法に定める消費者契約に該当しない場合は、当社は、当社の故意又は重過失に起因する場合を除き、Wattに関連してメンバー又は第三者に生じたあらゆる損害について一切の責任を負いません。
        <br />
        <br />
        上記各号により⽣じたメンバーの損害や、メンバー同⼠のトラブル等について、当社の過失（重過失を除きます）による債務不履行責任又は不法行為責任が認められる場合は、当社は通常生ずべき損害（逸失利益その他特別の事情によって生じた損害を除きます）の範囲内でのみ損害賠償責任を負うものとします。
      </Text>
      <Heading size="md" mt={4} mb={2}>
        第７条 プライバシー
      </Heading>
      （1）個人情報の取り扱いについて
      <br />
      ［1］個人情報取扱事業者
      <br />
      事業者の名称、個人情報保護管理責任者等の職名、連絡先については、弊社会社概要ページをご覧下さい。 <br />
      ［2］利用目的
      <br />
      当社は、メンバーに対してWattを提供するにあたり、必要な一定のメンバーの個人情報を取得しますが、これらの個人情報の利用目的は以下のとおりです。
      <br />
      &emsp;a.ログイン時における本人確認のため
      <br />
      &emsp;b.郵送、電話、電子メール等の方法により、当社又は当社のグループ会社の商品、サービスをご案内するため
      <br />
      &emsp;c.個人を識別できない形式に加工した上、統計データを作成するなど当社サービスの利用促進のため
      <br />
      &emsp;d.Wattに関し、必要に応じてメンバーに対し連絡をするため
      <br />
      &emsp;e.外部サービス連携機能利用時における本人確認のため <br />
      ［3］第三者提供
      <br />
      当社は、以下のいずれかに該当する場合を除き、メンバーの個人情報を第三者へ開示又は提供いたしません。
      <br />
      &emsp;a.メンバーの同意があるとき
      <br />
      &emsp;b.メンバーを識別することができない状態で統計的なデータとして開示・提供するとき
      <br />
      &emsp;c.法令に基づくとき
      <br />
      &emsp;d.人の生命、身体又は財産の保護のために必要な場合で、メンバーの同意を得ることが困難なとき
      <br />
      &emsp;e.公衆衛生の向上又は児童の健全な育成の推進のために特に必要があるときに、メンバーの同意を得ることが困難なとき
      <br />
      &emsp;f.国の機関若しくは地方公共団体又はその委託を受けた者が法令の定める事務を遂行することに対して協力する必要があるときに、メンバーの同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき
      <br />
      ［4］業務委託
      <br />
      当社は取得した個人情報の取扱いの全部又は一部を、必要な保護措置を講じた上、上記利用目的に必要な範囲において、委託する場合があります。
      <br />
      <Heading size="md" mt={4} mb={2}>
        第８条（知的財産権）
      </Heading>
      本サービス上を構成する文章、画像、プログラムその他のデータ等（但し、メンバーからのコメントは除きます。）についての一切の権利（所有権、知的財産権、肖像権、パブリシティー権等）は、当社又は当該権利を有する第三者に帰属するものとし、メンバーの皆様は、方法又は形態の如何を問わず、これらを当社に無断で複製、複写、転載、転送、蓄積、販売、出版その他メンバーの皆様個人の私的利用の範囲を超えて使用してはならないものとします。
      <Heading size="md" mt={4} mb={2}>
        第９条（退会手続き）
      </Heading>
      （1）Wattメンバーが退会を希望する場合は、当社の所定の退会手続きを行うものとします。
      <br />
      （2）Wattメンバーは、退会手続きを行った場合、当社でご利用いただいていたWattメンバーのアカウントに関する一切の権利、特典を失うものとします。
      <br />
      （3）Wattメンバーは、退会手続きによっても、自らの投稿した口コミ内容は削除されないことを予め承諾するものとします。
      <br />
      （4）Wattメンバーが退会手続きを完了した場合、又は、当社とWattメンバーとの間の本規約に基づく契約が終了した場合であっても、本規約は有効とします。
      <br />
      <Heading size="md" mt={4} mb={2}>
        第１０条（準拠法及び管轄）
      </Heading>
      本規約の準拠法は日本法とし、本規約及び本サービスに関する一切の紛争は、東京地方裁判所を第一審専属合意管轄裁判所とします。
    </Box>
  );
}
